import ansible

#  Jenkins简介Jenkins概述

#  •  Jenkins是由java编写的一款开源软件
#  和测试各种项目
#  •  Jenkins 的主要功能是监视重复工作的执行,例如软
#  件工程的构建或在 cron下设置的 jobs


#  持续集成

#  •  持续集成(CI)是当下最为流行的应用程序开发实践
#  方式
#  •  程序员在代码仓库中集成了修复bug、新特性开发或
#  是功能革新
#  •  CI工具通过自动构建和自动测试来验证结果。这可以
#  检测到当前程序代码的问题,迅速提供反馈


#  持续集成(续1)
#  程序员提交代码更新
#  到软件仓库(SVN/GIT)
#  CI服务器基于计划任务
#  查询仓库,并下载代码
#  CI服务器运行构建过程
#  并生成软件包
#  向开发团队发送构建
#  通知
#  CI服务器进行单元和集
#  成测试,存储测试结果Jenkins特点
#  •  简单、可扩展、用户界面友好
#  •  支持各种SCM(软件配置管理)工具,如SVN、GIT、
#  CVS等
#  •  能够构建各种风格的项目
#  •  可以选择安装多种插件
#  •  跨平台,几乎可以支持所有的平台

# 安装Jenkins下载Jenkins
# •  http://jenkins.io
# 
# 
# 
# 安装Jenkins
# •  安装Jenkins
